specialCombinations = [
    {
     "combination": "11",
     "interpretation": "一白水星為文昌星，有利讀書。靈感泉湧，文章振发，有利創作。同時利文職文官。"
    },
    {
     "combination": "12",
     "interpretation": "土(2)剋水(1)易有血、精、腎疾病。二黑土失令之時，土自然難以克制水，多應黃腫之病、體內水循環失調。"
    },
    {
     "combination": "13",
     "interpretation": "當元旺令，水生木主出聲名之人(3)。財祿豐盈，興家創業。失運時，變成煞氣，主是非，爭論之事(3)。"
    },
    {
     "combination": "14",
     "interpretation": "四一同宮，準发科名之顯。一白水主智慧，四綠木主名譽。四一並主桃花，詩酒風流。失令時。必主淫茵。"
    },
    {
     "combination": "15",
     "interpretation": "天都殺，五黃為毒素，說明主人易患生殖疾疾病、性病、酒精中毒。不利人丁，甚至有不孕，絕嗣之憂，因智慧(1)而容易得罪人(5)，會在朋友前show off"
    },
    {
     "combination": "16",
     "interpretation": "得運，金水相生，文章顯達，升官揚名。失運：一白坎水主桃花，失運則淫蕩、主出人智慧不用於正道，空思妄想之象。並且易得頭、骨之病"
    },
    {
     "combination": "17",
     "interpretation": "得運武職升遷，兒女當行桃花之運，酒肉滿盈生活美滿。失令時水冷金寒，兒女貪花戀酒，錢財散流，或背義忘親。"
    },
    {
     "combination": "18",
     "interpretation": "艮為鬼門。一白坎為隱伏，此方若陰暗污穢，主得病人易有幻覺(古時以鬼邪作祟比喻)八白艮為小石，一白坎為腎，二數組合多有患尿道結石。八與一組合失令時主出無知、智障之人，得令時主出忠孝，富貴之人。"
    },
    {
     "combination": "19",
     "interpretation": "水火既濟，合十佳運，主喜慶，謀事順遂。富貴非常，旺人丁。若失令不合局，主婚姻破裂心臟與腎、眼睛有病。"
    },
    {
     "combination": "21",
     "interpretation": "土(2)剋水(1)易有血、精、腎疾病。二黑土失令之時，土自然難以克制水，多應黃腫之病、體內水循環失調。"
    },
    {
     "combination": "22",
     "interpretation": "二黑土若當令為天醫星，主是醫藥興家，主出名醫。二黑坤土為皮肉，為熱癥，為老母，不得令時主多生病，不限於小兒。大多患脾胃之病。"
    },
    {
     "combination": "23",
     "interpretation": "鬥牛煞，必然引起家庭缺和，夫妻不和睦。常因與上司爭鬥而惹官非，或因爭鬥而傷身體，總之多勞碌奔波，阻礙破敗。"
    },
    {
     "combination": "24",
     "interpretation": "母(2)女(4)不和。婆(2)媳(4)不和。四綠巽主風，二者組合易患神經、中風、慢性腸胃病及呼吸疾病。 "
    },
    {
     "combination": "25",
     "interpretation": "二黑多主屬脾胃、肌肉发熱。黃腫、昏迷之病。五黃為毒索，易忠腫瘤，二五組合，多是重病死亡之災。"
    },
    {
     "combination": "26",
     "interpretation": "當運二黑巨門主发土地田莊，坤土生乾金雖進財但孤寒。六與二組合在失運時，主出僧尼或孤男寡婦。"
    },
    {
     "combination": "27",
     "interpretation": "生旺主得橫財巨富，出貴女或命卜家。失令則為流產、腹泄之癥"
    },
    {
     "combination": "28",
     "interpretation": "多发田產之富。失令，主破財損丁，家出僧道之流(艮坤為生死之門)。"
    },
    {
     "combination": "29",
     "interpretation": "生旺得令時，文筆生輝，田財巨積。失令時，火被土晦，反主出目疾、心臟病以及婆媳不和燦娌不睦。以及火炎土躁，不長萬物，主出人愚，不生育。"
    },
    {
     "combination": "31",
     "interpretation": "當元旺令，水生木主出聲名之人(3)。財祿豐盈，興家創業。失運時，變成煞氣，主是非，爭論之事(3)。"
    },
    {
     "combination": "32",
     "interpretation": "鬥牛煞，必然引起家庭缺和，夫妻不和睦。常因與上司爭鬥而惹官非，或因爭鬥而傷身體，總之多勞碌奔波，阻礙破敗。"
    },
    {
     "combination": "33",
     "interpretation": "震為雷，為車馬。主名聲遠播，光宗耀祖，出有名人物，如歌星、勇士。若失運。上山下水必主出好勇鬥之人、暴徒，手腳殘疾之人，井有啞吧同時肝膽之病。"
    },
    {
     "combination": "34",
     "interpretation": "當元得令之時，必是富貴之象。失令時，三與四組合，主出入不明理，或有手足有傷，以及有肝、膽之病。 "
    },
    {
     "combination": "35",
     "interpretation": "木克土，有激发急性災病，如流行性病癥。家宅不安、流產。"
    },
    {
     "combination": "36",
     "interpretation": "主出官貴之人。事業有成。名震遠方。若失令時，金克木，必主有手腳殘傷。"
    },
    {
     "combination": "37",
     "interpretation": "當元得旺，財源廣進，有文臣而兼武將之權貴。失運時，三與七組合為穿心煞，會有手足及肝膽之病。喜歡破新立舊。"
    },
    {
     "combination": "38",
     "interpretation": "若三八失令，多主克少男，小口損傷。家中兄弟不和，或因爭財產而惹官司。當元得旺，反出賢良之人，文才出眾。 "
    },
    {
     "combination": "39",
     "interpretation": "木火通明，聰明文采；若得當元旺運，必出文章滿腹大學家。雖不當元，也主聰敏之子"
    },
    {
     "combination": "41",
     "interpretation": "四一同宮，準发科名之顯。一白水主智慧，四綠木主名譽。四一並主桃花，詩酒風流。失令時。必主淫茵。"
    },
    {
     "combination": "42",
     "interpretation": "母(2)女(4)不和。婆(2)媳(4)不和。四綠巽主風，二者組合易患神經、中風、慢性腸胃病及呼吸疾病。 "
    },
    {
     "combination": "43",
     "interpretation": "當元得令之時，必是富貴之象。失令時，三與四組合，主出入不明理，或有手足有傷，以及有肝、膽之病。 "
    },
    {
     "combination": "44",
     "interpretation": "文曲雙星齊到，兒女成績優異，喜逢登料。大利文職，頗有聲望。當失令衰氣，四綠木星為風，風性飄苗，四與四組合，主出入漂泊四海，風流不斷，寡婦當家。男兒離家出走。"
    },
    {
     "combination": "45",
     "interpretation": "當元得令，家業興旺，事業順利。失令時，男兒好飲，無所作為，婦人易生乳病，家境落敗。容易看見靈體(4)、中風"
    },
    {
     "combination": "46",
     "interpretation": "主藝術才華出眾，名利雙收，姻結權貴富豪，考試榜首。失元衰時，六白乾金為夫，四綠巽為婦。金克木主喪妻。身敗名裂，犯罪，並有肝膽之病。 "
    },
    {
     "combination": "47",
     "interpretation": "當元得令，主有權威，必有婦人主政，有出女強人，事業成功。 文昌破體，主不出文秀，功名無望。二木被金克制，易有出傷殘之人、患肝炎之病。"
    },
    {
     "combination": "48",
     "interpretation": "妻欺少夫，婦奪夫權。"
    },
    {
     "combination": "49",
     "interpretation": "當元得令，家業興旺，出聰明之士，文章振发，有名聲。當失元衰氣，家嫂爭權，婦人不和，易犯桃花之劫，常犯眼疾或有火災之厄。"
    },
    {
     "combination": "51",
     "interpretation": "天都殺，五黃為毒素，說明主人易患生殖疾疾病、性病、酒精中毒。不利人丁，甚至有不孕，絕嗣之憂"
    },
    {
     "combination": "52",
     "interpretation": "二黑多主屬脾胃、肌肉发熱。黃腫、昏迷之病。五黃為毒索，易忠腫瘤，二五組合，多是重病死亡之災。"
    },
    {
     "combination": "53",
     "interpretation": "木克土，有激发急性災病，如流行性病癥。"
    },
    {
     "combination": "54",
     "interpretation": "當元得令，家業興旺，事業順利。失令時，男兒好飲，無所作為，婦人易生乳病，家境落敗"
    },
    {
     "combination": "55",
     "interpretation": "輕則災病，重則有損丁之象。"
    },
    {
     "combination": "56",
     "interpretation": "當元得令，頗得錢財。失令時，有患頭部頑疾。同時有服毒自殺之象。"
    },
    {
     "combination": "57",
     "interpretation": "是指七為兌為弼輔和五黃毒性在一起，出人因男女淫亂無度引起性病、梅毒。七赤金為口，五黃毒生之，亦主吸毒品。 "
    },
    {
     "combination": "58",
     "interpretation": "當元得令，有田莊地產之富，兒女孝順。失令衰弱婦生愚鈍之子；家人多有眼病，或有心悶頭痛。若遇太歲，恐有血光之災。"
    },
    {
     "combination": "59",
     "interpretation": "含義九紫離火，味苦性烈，與五黃毒氣合為毒藥。此二者組合，有吸毒品、服毒、性病、淫亂、火災的含義。"
    },
    {
     "combination": "61",
     "interpretation": "得運，金水相生，文章顯達，升官揚名。失運：一白坎水主桃花，失運則淫蕩。六白乾金，乾為天門。同時主出人智慧不用於正道，空思妄想之象。並且易得頭、骨之病"
    },
    {
     "combination": "62",
     "interpretation": "當運二黑巨門主发土地田莊，坤土生乾金雖進財但孤寒。六與二組合在失運時，主出僧尼或孤男寡婦。"
    },
    {
     "combination": "63",
     "interpretation": "主出官貴之人。事業有成。名震遠方。若失令時，金克木，必主有手腳殘傷。"
    },
    {
     "combination": "64",
     "interpretation": "主藝術才華出眾，名利雙收，姻結權貴富豪，考試榜首。失元衰時，六白乾金為夫，四綠巽為婦。金克木主喪妻。身敗名裂，犯罪，並有肝膽之病。 "
    },
    {
     "combination": "65",
     "interpretation": "當元得令，頗得錢財。失令時，有患頭部頑疾。同時有服毒自殺之象。"
    },
    {
     "combination": "66"
    },
    {
     "combination": "67",
     "interpretation": "當元得令，多出武將，刑官。如果夫運衰弱時，此二星組合，則為交劍劫殺，官場爭執，家庭不和，只有刀劍之傷，車馬之禍。並且易患口疾、頭痛或血光之災。"
    },
    {
     "combination": "68",
     "interpretation": "金主貴，土主富，此二星組合當元得令，則主富貴雙全，功名利祿齊來，家業興盛，子孫受蔭。"
    },
    {
     "combination": "69",
     "interpretation": "回祿之災(搶自己資源再自己後起爐灶)，破財、為子不孝(對父反叛)、工作有困難、腦病、中風、糖尿病、心臟病、腎病、腸病、頭痛、甩頭髮、和尚\/修行者、因腸胃不好而差"
    },
    {
     "combination": "71",
     "interpretation": "得運武職升遷，兒女當行桃花之運，酒肉滿盈生活美滿。失令時水冷金寒，兒女貪花戀酒，錢財散流，或背義忘親。"
    },
    {
     "combination": "72",
     "interpretation": "生旺主得橫財巨富，出貴女或命卜家。失令則為流產、腹泄之癥"
    },
    {
     "combination": "73",
     "interpretation": "當元得旺，財源廣進，有文臣而兼武將之權貴。失運時，三與七組合為穿心煞，會有手足及肝膽之病。喜歡破新立舊。"
    },
    {
     "combination": "74",
     "interpretation": "當元得令，主有權威，必有婦人主政，有出女強人，事業成功。 文昌破體，主不出文秀，功名無望。二木被金克制，易有出傷殘之人、患肝炎之病。"
    },
    {
     "combination": "75"
    },
    {
     "combination": "76",
     "interpretation": "當元得令，多出武將，刑官。如果夫運衰弱時，此二星組合，則為交劍劫殺，官場爭執，家庭不和，只有刀劍之傷，車馬之禍。並且易患口疾、頭痛或血光之災。"
    },
    {
     "combination": "77",
     "interpretation": "七七組合得令，主出美女、律師金融界巨子、名嘴(演講家)、改革家。失令，主嫖賭破家萌生，甚至肢體殘傷。同時劫賊入室。扣至桃花之劫。 "
    },
    {
     "combination": "78",
     "interpretation": "當元得旺之時，文職武權，財祿兩得，夫妻和睦，兒女安康。失令之時，財產易敗，夫妻成仇，同時男女雖有一拍即合，招手成婚，但亦速冷卻，即同陌路，必有分開。 "
    },
    {
     "combination": "79",
     "interpretation": "得令，主婚姻喜慶，出美女，以及律師軍事家、改革家、藝術成名之人。"
    },
    {
     "combination": "81",
     "interpretation": "艮為鬼門。一白坎為隱伏，此方若陰暗污穢，主得病人易有幻覺(古時以鬼邪作祟比喻)八白艮為小石，一白坎為腎，二數組合多有患尿道結石。八與一組合失令時主出無知、智障之人，得令時主出忠孝，富貴之人。"
    },
    {
     "combination": "82",
     "interpretation": "多发田產之富。失令，主破財損丁，家出僧道之流(艮坤為生死之門)。"
    },
    {
     "combination": "83",
     "interpretation": "若三八失令，多主克少男，小口損傷。家中兄弟不和，或因爭財產而惹官司。當元得旺，反出賢良之人，文才出眾。 "
    },
    {
     "combination": "84",
     "interpretation": "妻欺少夫，婦奪夫權。"
    },
    {
     "combination": "85",
     "interpretation": "當元得令，大发財祿，家業安康。當失令衰弱，破財傷筋，小口病厄，運勢破壞。並有腸胃疾病之苦。"
    },
    {
     "combination": "86",
     "interpretation": "金主貴，土主富，此二星組合當元得令，則主富貴雙全，功名利祿齊來，家業興盛，子孫受蔭。"
    },
    {
     "combination": "87",
     "interpretation": "當元得旺之時，文職武權，財祿兩得，夫妻和睦，兒女安康。失令之時，財產易敗，夫妻成仇，同時男女雖有一拍即合，招手成婚，但亦速冷卻，即同陌路，必有分開。 "
    },
    {
     "combination": "88",
     "interpretation": "當元得令。大利文才學業。大发田莊地產之富，雙喜臨門，事業興旺。當失令衰弱時，家業破敢，並有傷筋骨以及肩骨酸痛之苦。 "
    },
    {
     "combination": "89",
     "interpretation": "當元得旺時，自然大发橫財，富堪敵國。失令衰弱時，火炎土燥，婦生愚子，家人或眼疾並有火災之厄。"
    },
    {
     "combination": "91",
     "interpretation": "水火既濟，合十佳運，主喜慶，謀事順遂。富貴非常，旺人丁。若失令不合局，主婚姻破裂心臟與腎、眼睛有病。"
    },
    {
     "combination": "92",
     "interpretation": "生旺得令時，文筆生輝，田財巨積。失令時，火被土晦，反主出目疾、心臟病以及婆媳不和燦娌不睦。以及火炎土躁，不長萬物，主出人愚，不生育。"
    },
    {
     "combination": "93",
     "interpretation": "木火通明，聰明文采；若得當元旺運，必出文章滿腹大學家。雖不當元，也主聰敏之子"
    },
    {
     "combination": "94",
     "interpretation": "當元得令，家業興旺，出聰明之士，文章振发，有名聲。當失元衰氣，家嫂爭權，婦人不和，易犯桃花之劫，常犯眼疾或有火災之厄。"
    },
    {
     "combination": "95",
     "interpretation": "九紫離火，味苦性烈，與五黃毒氣合為毒藥。此二者組合，有吸毒品、服毒、性病、淫亂、火災的含義。"
    },
    {
     "combination": "96",
     "interpretation": "回祿之災(搶自己資源再自己後起爐灶)，破財、為子不孝(對父反叛)、工作有困難、腦病、中風、糖尿病、心臟病、腎病、腸病、頭痛、甩頭髮、和尚\/修行者、因腸胃不好而差"
    },
    {
     "combination": "97",
     "interpretation": "得令，主婚姻喜慶，出美女，以及律師軍事家、改革家、藝術成名之人。火剋金，說話沒氣、喉嚨痛、上氣不接下氣、口腔問題"
    },
    {
     "combination": "98",
     "interpretation": "當元得旺時，自然大发橫財，富堪敵國。失令衰弱時，火炎土燥，婦生愚子，家人或眼疾並有火災之厄。"
    },
    {
     "combination": "99",
     "interpretation": "當元得旺主即刻发福，文章顯達，名傳四誨。失令衰弱，婦多產女兒，男女好色，家中易出眼疾瞎目之人。 "
    }
   ]